from utils import important_message


def main() -> None:
    """
    Получает из stdin текст сообщения.
    """
    message = input('Текст сообщения: ')
    print(important_message(message))
    

# main()
# Текст сообщения: Добро должно быть с кулаками
#=====================================================================================================================#
#                                                                                                                     #
#                                             Добро должно быть с кулаками                                            #
#                                                                                                                     #
#=====================================================================================================================#